C-c ' для редактирования

#+TBLNAME: tariffs
|----------------+--------------+---------------+-----------+---------------|
| Услуга         | Горячая вода | Холодная вода | Водоотвод | Электричество |
|                |        м3/м3 |         м3/м3 |           |         кВт/ч |
|----------------+--------------+---------------+-----------+---------------|
| Цена           |       135.79 |         29.16 |     20.69 |          3.28 |
| с июля 2015    |       151.36 |         30.87 |     21.90 |          3.52 |
| с августа 2015 |       163.24 |         33.03 |     23.43 |          3.77 |
| с июля 2017    |       180.55 |         35.40 |     25.12 |          4.04 |
|----------------+--------------+---------------+-----------+---------------|
#+TBLFM:

* 2015
#+TBLNAME: bills2015
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Месяц     | Горячая вода | Холодная вода | Водоотвод |     Итого |                   Электричество |
|           |        м3/м3 |         м3/м3 |           |           |                           кВт/ч |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Январь    |              |               |           |           |                                 |
| показания |      122.719 |       111.187 |           |           |                          9108.3 |
| расход    |       3.6777 |        3.5235 |    7.2012 |           |                             156 |
|           |              |               |           |           |                                 |
| цена      |    499.39488 |     102.74526 | 148.99283 | 751.13297 |                          511.68 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Февраль   |              |               |           |           |                                 |
| показания |      127.613 |       115.186 |           |           |                          9249.9 |
| расход    |        4.894 |         3.999 |     8.893 |           |                           141.6 |
|           |              |               |           |           |                                 |
| цена      |    664.55626 |     116.61084 | 183.99617 | 965.16327 |                         464.448 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Март      |              |               |           |           |                                 |
| показания |      132.331 |       119.167 |           |           |                          9409.1 |
| расход    |        4.718 |         3.981 |     8.699 |           |                           159.2 |
|           |              |               |           |           |                                 |
| цена      |    640.65722 |     116.08596 | 179.98231 | 936.72549 |                         522.176 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Апрель    |              |               |           |           |                                 |
| показания |      137.277 |       123.732 |           |           |                          9597.7 |
| расход    |        4.946 |         4.565 |     9.511 |           |                           188.6 |
|           |              |               |           |           |                                 |
| цена      |    671.61734 |      133.1154 | 196.78259 | 1001.5153 |                         618.608 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Май       |              |               |           |           |                                 |
| показания |      141.675 |       127.655 |           |           |                          9765.8 |
| расход    |        4.398 |         3.923 |     8.321 |           |                           168.1 |
|           |              |               |           |           |                                 |
| цена      |    597.20442 |     114.39468 | 172.16149 | 883.76059 |                         551.368 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Июнь      |              |               |           |           |                                 |
| показания |      145.160 |       131.978 |           |           |                          9908.4 |
| расход    |        3.485 |         4.323 |     7.808 |           |                           142.6 |
|           |              |               |           |           |                                 |
| цена      |    473.22815 |     126.05868 | 161.54752 | 760.83435 |                         467.728 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Июль      |              |               |           |           |                                 |
| показания |      149.827 |       137.400 |           |           |                         10070.0 |
| расход    |        4.667 |         5.422 |    10.089 |           |                           161.6 |
|           |              |               |           |           |                                 |
| цена      |    633.73193 |     158.10552 | 208.74141 | 1000.5789 |                         568.832 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Август    |              |               |           |           |                                 |
| показания |      153.096 |       141.297 |           |           |                         10180.3 |
| расход    |        3.269 |         3.897 |     7.166 |           |                           110.3 |
|           |              |               |           |           |                                 |
| цена      |    494.79584 |     120.30039 |  156.9354 | 772.03163 |                         388.256 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Сентябрь  |              |               |           |           |                                 |
| показания |      156.064 |       144.095 |           |           |                         10263.6 |
| расход    |        2.968 |         2.798 |     5.766 |           |                            83.3 |
|           |              |               |           |           | свет 15.36 переплата => 277.856 |
| цена      |    449.23648 |      86.37426 |  126.2754 | 661.88614 |                         293.216 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Октябрь   |              |               |           |           |                                 |
| показания |      161.607 |       149.056 |           |           |                         10408.4 |
| расход    |        5.543 |         4.961 |    10.504 |           |                           144.8 |
|           |              |               |           |           |                                 |
| цена      |    838.98848 |     153.14607 |  230.0376 | 1222.1722 |                         509.696 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Ноябрь    |              |               |           |           |                                 |
| показания |      168.236 |       153.921 |           |           |                         10577.3 |
| расход    |        6.629 |         4.865 |    11.494 |           |                           168.9 |
|           |              |               |           |           |   свет 0.35 переплата => 594.18 |
| цена      |    1003.3654 |     150.18255 |  251.7186 | 1405.2666 |                         594.528 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|
| Декабрь   |              |               |           |           |                                 |
| показания |      173.527 |       157.845 |           |           |                         10707.4 |
| расход    |        5.291 |         3.924 |     9.215 |           |                           130.1 |
|           |              |               |           |           |   свет 0.35 переплата => 457.6  |
| цена      |    800.84576 |     121.13388 |  201.8085 | 1123.7881 |                         457.952 |
|-----------+--------------+---------------+-----------+-----------+---------------------------------|

#+TBLFM: @5$4=$2 + $3::@7$2=@-2$2 * remote(tariffs, @3$2)::@7$3=@-2$3 * remote(tariffs, @3$3)::@7$4=@-2$4 * remote(tariffs, @3$4)::@7$5=$2 + $3 + $4::@7$6=@-2$6 * remote(tariffs, @3$5)::@10$2=@-1$2 - @-6$2::@10$3=@-1$3 - @-6$3::@10$4=$2 + $3::@10$6=@-1$6 - @-6$6::@12$2=@-2$2 * remote(tariffs, @3$2)::@12$3=@-2$3 * remote(tariffs, @3$3)::@12$4=@-2$4 * remote(tariffs, @3$4)::@12$5=$2 + $3 + $4::@12$6=@-2$6 * remote(tariffs, @3$5)::@15$2=@-1$2 - @-6$2::@15$3=@-1$3 - @-6$3::@15$4=$2 + $3::@15$6=@-1$6 - @-6$6::@17$2=@-2$2 * remote(tariffs, @3$2)::@17$3=@-2$3 * remote(tariffs, @3$3)::@17$4=@-2$4 * remote(tariffs, @3$4)::@17$5=$2 + $3 + $4::@17$6=@-2$6 * remote(tariffs, @3$5)::@20$2=@-1$2 - @-6$2::@20$3=@-1$3 - @-6$3::@20$4=$2 + $3::@20$6=@-1$6 - @-6$6::@22$2=@-2$2 * remote(tariffs, @3$2)::@22$3=@-2$3 * remote(tariffs, @3$3)::@22$4=@-2$4 * remote(tariffs, @3$4)::@22$5=$2 + $3 + $4::@22$6=@-2$6 * remote(tariffs, @3$5)::@25$2=@-1$2 - @-6$2::@25$3=@-1$3 - @-6$3::@25$4=$2 + $3::@25$6=@-1$6 - @-6$6::@27$2=@-2$2 * remote(tariffs, @3$2)::@27$3=@-2$3 * remote(tariffs, @3$3)::@27$4=@-2$4 * remote(tariffs, @3$4)::@27$5=$2 + $3 + $4::@27$6=@-2$6 * remote(tariffs, @3$5)::@30$2=@-1$2 - @-6$2::@30$3=@-1$3 - @-6$3::@30$4=$2 + $3::@30$6=@-1$6 - @-6$6::@32$2=@-2$2 * remote(tariffs, @3$2)::@32$3=@-2$3 * remote(tariffs, @3$3)::@32$4=@-2$4 * remote(tariffs, @3$4)::@32$5=$2 + $3 + $4::@32$6=@-2$6 * remote(tariffs, @3$5)::@35$2=@-1$2 - @-6$2::@35$3=@-1$3 - @-6$3::@35$4=$2 + $3::@35$6=@-1$6 - @-6$6::@37$2=@-2$2 * remote(tariffs, @3$2)::@37$3=@-2$3 * remote(tariffs, @3$3)::@37$4=@-2$4 * remote(tariffs, @3$4)::@37$5=$2 + $3 + $4::@37$6=@-2$6 * remote(tariffs, @4$5)::@40$2=@-1$2 - @-6$2::@40$3=@-1$3 - @-6$3::@40$4=$2 + $3::@40$6=@-1$6 - @-6$6::@42$2=@-2$2 * remote(tariffs, @4$2)::@42$3=@-2$3 * remote(tariffs, @4$3)::@42$4=@-2$4 * remote(tariffs, @4$4)::@42$5=$2 + $3 + $4::@42$6=@-2$6 * remote(tariffs, @4$5)::@45$2=@-1$2 - @-6$2::@45$3=@-1$3 - @-6$3::@45$4=$2 + $3::@45$6=@-1$6 - @-6$6::@47$2=@-2$2 * remote(tariffs, @4$2)::@47$3=@-2$3 * remote(tariffs, @4$3)::@47$4=@-2$4 * remote(tariffs, @4$4)::@47$5=$2 + $3 + $4::@47$6=@-2$6 * remote(tariffs, @4$5)::@50$2=@-1$2 - @-6$2::@50$3=@-1$3 - @-6$3::@50$4=$2 + $3::@50$6=@-1$6 - @-6$6::@52$2=@-2$2 * remote(tariffs, @4$2)::@52$3=@-2$3 * remote(tariffs, @4$3)::@52$4=@-2$4 * remote(tariffs, @4$4)::@52$5=$2 + $3 + $4::@52$6=@-2$6 * remote(tariffs, @4$5)::@55$2=@-1$2 - @-6$2::@55$3=@-1$3 - @-6$3::@55$4=$2 + $3::@55$6=@-1$6 - @-6$6::@57$2=@-2$2 * remote(tariffs, @4$2)::@57$3=@-2$3 * remote(tariffs, @4$3)::@57$4=@-2$4 * remote(tariffs, @4$4)::@57$5=$2 + $3 + $4::@57$6=@-2$6 * remote(tariffs, @4$5)::@60$2=@-1$2 - @-6$2::@60$3=@-1$3 - @-6$3::@60$4=$2 + $3::@60$6=@-1$6 - @-6$6::@62$2=@-2$2 * remote(tariffs, @4$2)::@62$3=@-2$3 * remote(tariffs, @4$3)::@62$4=@-2$4 * remote(tariffs, @4$4)::@62$5=$2 + $3 + $4::@62$6=@-2$6 * remote(tariffs, @4$5)

* 2016
#+TBLNAME: bills2016
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Месяц     | Горячая вода | Холодная вода | Водоотвод |     Итого |             Электричество |
|           |        м3/м3 |         м3/м3 |           |           |                     кВт/ч |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Январь    |              |               |           |           |                           |
| показания |      180.367 |       163.222 |           |           |                   10850.5 |
| расход    |         6.84 |         5.377 |    12.217 |           |                     143.1 |
|           |              |               |           |           |                           |
| цена      |    1035.3024 |     165.98799 |  267.5523 | 1468.8427 |                   503.712 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Февраль   |              |               |           |           |                           |
| показания |      187.431 |       168.584 |           |           |                   10992.5 |
| расход    |        7.064 |         5.362 |    12.426 |           |                      142. |
|           |              |               |           |           |                           |
| цена      |    1069.2070 |     165.52494 |  272.1294 | 1506.8613 |                    499.84 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Март      |              |               |           |           |                           |
| показания |      195.288 |       175.530 |           |           |                   11152.0 |
| расход    |        7.857 |         6.946 |    14.803 |           |                     159.5 |
|           |              |               |           |           |                           |
| цена      |    1189.2355 |     214.42302 |  324.1857 | 1727.8442 |                    561.44 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Апрель    |              |               |           |           |                           |
| показания |      204.902 |       184.657 |           |           |                   11401.6 |
| расход    |        9.614 |         9.127 |    18.741 |           |                     249.6 |
|           |              |               |           |           | недоплата 1.76 => 880.352 |
| цена      |    1455.1750 |     281.75049 |  410.4279 | 2147.3534 |                   878.592 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Май       |              |               |           |           |                           |
| показания |      210.792 |       192.597 |           |           |                   11607.4 |
| расход    |         5.89 |          7.94 |     13.83 |           |                     205.8 |
|           |              |               |           |           |                           |
| цена      |     891.5104 |      245.1078 |   302.877 | 1439.4952 |                   724.416 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Июнь      |              |               |           |           |                           |
| показания |      219.085 |       201.703 |           |           |                   11839.2 |
| расход    |        8.293 |         9.106 |    17.399 |           |                     231.8 |
|           |              |               |           |           |                           |
| цена      |    1255.2285 |     281.10222 |  381.0381 | 1917.3688 |                   815.936 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Июль      |              |               |           |           |                           |
| показания |      224.527 |       209.953 |           |           |                   12018.6 |
| расход    |        5.442 |          8.25 |    13.692 |           |                     179.4 |
|           |              |               |           |           |                           |
| цена      |    823.70112 |      254.6775 |  299.8548 | 1378.2334 |                   631.488 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Август    |              |               |           |           |                           |
| показания |      225.959 |       212.307 |           |           |                   12105.7 |
| расход    |        1.432 |         2.354 |     3.786 |           |                      87.1 |
|           |              |               |           |           |                           |
| цена      |    233.75968 |      77.75262 |  88.70598 | 400.21828 |                   328.367 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Сентябрь  |              |               |           |           |                           |
| показания |      226.920 |        213.79 |           |           |                   12187.7 |
| расход    |        0.961 |         1.483 |     2.444 |           |                       82. |
|           |              |               |           |           |                           |
| цена      |    156.87364 |      48.98349 |  57.26292 | 263.12005 |                    309.14 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Октябрь   |              |               |           |           |                           |
| показания |      233.995 |       221.149 |           |           |                   12385.6 |
| расход    |        7.075 |         7.359 |    14.434 |           |                     197.9 |
|           |              |               |           |           |                           |
| цена      |     1154.923 |     243.06777 | 338.18862 | 1736.1794 |                   746.083 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Ноябрь    |              |               |           |           |                           |
| показания |      242.937 |       229.251 |           |           |                   12611.2 |
| расход    |        8.942 |         8.102 |    17.044 |           |                     225.6 |
|           |              |               |           |           |                           |
| цена      |    1459.6921 |     267.60906 | 399.34092 | 2126.6421 |                   850.512 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
| Декабрь   |              |               |           |           |                           |
| показания |      252.292 |       237.136 |           |           |                   12852.6 |
| расход    |        9.355 |         7.885 |     17.24 |           |                     241.4 |
|           |              |               |           |           | недоплата 1.52 => 911.598 |
| цена      |    1527.1102 |     260.44155 |  403.9332 | 2191.4850 |                   910.078 |
|-----------+--------------+---------------+-----------+-----------+---------------------------|
#+TBLFM: @5$2=@-1$2 - remote(bills2015, @59$2)::@5$3=@-1$3 - remote(bills2015, @59$3)::@5$4=$2 + $3::@5$6=@-1$6 - remote(bills2015, @59$6)::@7$2=@-2$2 * remote(tariffs, @4$2)::@7$3=@-2$3 * remote(tariffs, @4$3)::@7$4=@-2$4 * remote(tariffs, @4$4)::@7$5=$2 + $3 + $4::@7$6=@-2$6 * remote(tariffs, @4$5)::@10$2=@-1$2 - @-6$2::@10$3=@-1$3 - @-6$3::@10$4=$2 + $3::@10$6=@-1$6 - @-6$6::@12$2=@-2$2 * remote(tariffs, @4$2)::@12$3=@-2$3 * remote(tariffs, @4$3)::@12$4=@-2$4 * remote(tariffs, @4$4)::@12$5=$2 + $3 + $4::@12$6=@-2$6 * remote(tariffs, @4$5)::@15$2=@-1$2 - @-6$2::@15$3=@-1$3 - @-6$3::@15$4=$2 + $3::@15$6=@-1$6 - @-6$6::@17$2=@-2$2 * remote(tariffs, @4$2)::@17$3=@-2$3 * remote(tariffs, @4$3)::@17$4=@-2$4 * remote(tariffs, @4$4)::@17$5=$2 + $3 + $4::@17$6=@-2$6 * remote(tariffs, @4$5)::@20$2=@-1$2 - @-6$2::@20$3=@-1$3 - @-6$3::@20$4=$2 + $3::@20$6=@-1$6 - @-6$6::@22$2=@-2$2 * remote(tariffs, @4$2)::@22$3=@-2$3 * remote(tariffs, @4$3)::@22$4=@-2$4 * remote(tariffs, @4$4)::@22$5=$2 + $3 + $4::@22$6=@-2$6 * remote(tariffs, @4$5)::@25$2=@-1$2 - @-6$2::@25$3=@-1$3 - @-6$3::@25$4=$2 + $3::@25$6=@-1$6 - @-6$6::@27$2=@-2$2 * remote(tariffs, @4$2)::@27$3=@-2$3 * remote(tariffs, @4$3)::@27$4=@-2$4 * remote(tariffs, @4$4)::@27$5=$2 + $3 + $4::@27$6=@-2$6 * remote(tariffs, @4$5)::@30$2=@-1$2 - @-6$2::@30$3=@-1$3 - @-6$3::@30$4=$2 + $3::@30$6=@-1$6 - @-6$6::@32$2=@-2$2 * remote(tariffs, @4$2)::@32$3=@-2$3 * remote(tariffs, @4$3)::@32$4=@-2$4 * remote(tariffs, @4$4)::@32$5=$2 + $3 + $4::@32$6=@-2$6 * remote(tariffs, @4$5)::@35$2=@-1$2 - @-6$2::@35$3=@-1$3 - @-6$3::@35$4=$2 + $3::@35$6=@-1$6 - @-6$6::@37$2=@-2$2 * remote(tariffs, @4$2)::@37$3=@-2$3 * remote(tariffs, @4$3)::@37$4=@-2$4 * remote(tariffs, @4$4)::@37$5=$2 + $3 + $4::@37$6=@-2$6 * remote(tariffs, @4$5)::@40$2=@-1$2 - @-6$2::@40$3=@-1$3 - @-6$3::@40$4=$2 + $3::@40$6=@-1$6 - @-6$6::@42$2=@-2$2 * remote(tariffs, @5$2)::@42$3=@-2$3 * remote(tariffs, @5$3)::@42$4=@-2$4 * remote(tariffs, @5$4)::@42$5=$2 + $3 + $4::@42$6=@-2$6 * remote(tariffs, @5$5)::@45$2=@-1$2 - @-6$2::@45$3=@-1$3 - @-6$3::@45$4=$2 + $3::@45$6=@-1$6 - @-6$6::@47$2=@-2$2 * remote(tariffs, @5$2)::@47$3=@-2$3 * remote(tariffs, @5$3)::@47$4=@-2$4 * remote(tariffs, @5$4)::@47$5=$2 + $3 + $4::@47$6=@-2$6 * remote(tariffs, @5$5)::@50$2=@-1$2 - @-6$2::@50$3=@-1$3 - @-6$3::@50$4=$2 + $3::@50$6=@-1$6 - @-6$6::@52$2=@-2$2 * remote(tariffs, @5$2)::@52$3=@-2$3 * remote(tariffs, @5$3)::@52$4=@-2$4 * remote(tariffs, @5$4)::@52$5=$2 + $3 + $4::@52$6=@-2$6 * remote(tariffs, @5$5)::@55$2=@-1$2 - @-6$2::@55$3=@-1$3 - @-6$3::@55$4=$2 + $3::@55$6=@-1$6 - @-6$6::@57$2=@-2$2 * remote(tariffs, @5$2)::@57$3=@-2$3 * remote(tariffs, @5$3)::@57$4=@-2$4 * remote(tariffs, @5$4)::@57$5=$2 + $3 + $4::@57$6=@-2$6 * remote(tariffs, @5$5)::@60$2=@-1$2 - @-6$2::@60$3=@-1$3 - @-6$3::@60$4=$2 + $3::@60$6=@-1$6 - @-6$6::@62$2=@-2$2 * remote(tariffs, @5$2)::@62$3=@-2$3 * remote(tariffs, @5$3)::@62$4=@-2$4 * remote(tariffs, @5$4)::@62$5=$2 + $3 + $4::@62$6=@-2$6 * remote(tariffs, @5$5)

* 2017
#+TBLNAME: bills2017
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Месяц     | Горячая вода | Холодная вода | Водоотвод |     Итого |               Электричество |
|           |        м3/м3 |         м3/м3 |           |           |                       кВт/ч |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Январь    |              |               |           |           |                             |
| показания |      263.379 |       245.922 |           |           |                     13051.8 |
| расход    |       11.087 |         8.786 |    19.873 |           |                       199.2 |
| ошибочно  |     оплачено |            по | предыдущ. |    тарифу |   переплата 1.50 => 699.684 |
| цена      |    1678.1283 |     271.22382 |  435.2187 | 2384.5708 |                     701.184 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Февраль   |              |               |           |           |                             |
| показания |      272.130 |       252.773 |           |           |                     13276.1 |
| расход    |        8.751 |         6.851 |    15.602 |           |                       224.3 |
|           |              |               |           |           |  недоплата 49.05 => 894.661 |
| цена      |    1428.5132 |     226.28853 | 365.55486 | 2020.3566 |                     845.611 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Март      |              |               |           |           |     электричество округляют |
| показания |      281.069 |       259.342 |           |           |                     13509.8 |
| расход    |        8.939 |         6.569 |    15.508 |           |                         233 |
|           |              |               |           |           |  "недоплата" 2.64 => 881.05 |
| цена      |    1459.2024 |     216.97407 | 363.35244 | 2039.5289 |                      878.41 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Апрель    |              |               |           |           |                             |
| показания |      291.911 |       267.574 |           |           |                     13783.7 |
| расход    |       10.842 |         8.232 |    19.074 |           |                         273 |
|           |              |               |           |           |                             |
| цена      |    1769.8481 |     271.90296 | 446.90382 | 2488.6549 |                     1029.21 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Май       |              |               |           |           |                             |
| показания |      300.354 |       274.788 |           |           |                     14016.8 |
| расход    |        8.443 |         7.214 |    15.657 |           |                         233 |
|           |              |               |           |           | переплачу 2 кВт/ч => 885.95 |
| цена      |    1378.2353 |     238.27842 | 366.84351 | 1983.3572 |                      878.41 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Июнь      |              |               |           |           |                             |
| показания |      305.938 |       283.214 |           |           |                     14264.5 |
| расход    |        5.584 |         8.426 |     14.01 |           |                         247 |
|           |              |               |           |           | переплачу 1 кВт/ч => 934.96 |
| цена      |    911.53216 |     278.31078 |  328.2543 | 1518.0972 |                      931.19 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Июль      |              |               |           |           |                             |
| показания |      311.897 |       290.254 |           |           |                     14444.8 |
| расход    |        5.959 |          7.04 |    12.999 |           |                         180 |
|           |              |               |           |           |                             |
| цена      |    1075.8975 |       249.216 | 326.53488 | 1651.6484 |                       727.2 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Август    |              |               |           |           |                             |
| показания |      314.117 |       293.945 |           |           |                     14572.0 |
| расход    |         2.22 |         3.691 |     5.911 |           |                         127 |
|           |              |               |           |           | переплата 28.88 =>    484.2 |
| цена      |      400.821 |      130.6614 | 148.48432 | 679.96672 |                      513.08 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Сентябрь  |              |               |           |           |                             |
| показания |      319.083 |       299.259 |           |           |                     14762.1 |
| расход    |        4.966 |         5.314 |     10.28 |           |                         190 |
|           |              |               |           |           | недоплата  4.04 =>    771.7 |
| цена      |     896.6113 |      188.1156 |  258.2336 | 1342.9605 |                       767.6 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Октябрь   |              |               |           |           |                             |
| показания |      326.360 |       305.754 |           |           |                     14991.4 |
| расход    |        7.277 |         6.495 |    13.772 |           |                         229 |
|           |        2.311 |               |           |           |    недоплата  0.06 => 925.1 |
| цена      |    1313.8624 |       229.923 | 345.95264 | 1889.7380 |                      925.16 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Ноябрь    |              |               |           |           |                             |
| показания |      334.944 |       313.046 |           |           |                     15252.6 |
| расход    |        8.584 |         7.292 |    15.876 |           |                         261 |
|           |              |               |           |           |                             |
| цена      |    1549.8412 |      258.1368 | 398.80512 | 2206.7831 |                     1054.44 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
| Декабрь   |              |               |           |           |                             |
| показания |      343.704 |       320.160 |           |           |                     15505.8 |
| расход    |         8.76 |         7.114 |    15.874 |           |                         253 |
|           |              |               |           |           |          6735.2699 - 138.79 |
| цена      |     1581.618 |      251.8356 | 398.75488 | 2232.2085 |                     1022.12 |
|-----------+--------------+---------------+-----------+-----------+-----------------------------|
#+TBLFM: @5$2=@-1$2 - remote(bills2016, @59$2)::@5$3=@-1$3 - remote(bills2016, @59$3)::@5$4=$2 + $3::@5$6=@-1$6 - remote(bills2016, @59$6)::@7$2=@-2$2 * remote(tariffs, @4$2)::@7$3=@-2$3 * remote(tariffs, @4$3)::@7$4=@-2$4 * remote(tariffs, @4$4)::@7$5=$2 + $3 + $4::@7$6=@-2$6 * remote(tariffs, @4$5)::@10$2=@-1$2 - @-6$2::@10$3=@-1$3 - @-6$3::@10$4=$2 + $3::@10$6=@-1$6 - @-6$6::@12$2=@-2$2 * remote(tariffs, @5$2)::@12$3=@-2$3 * remote(tariffs, @5$3)::@12$4=@-2$4 * remote(tariffs, @5$4)::@12$5=$2 + $3 + $4::@12$6=@-2$6 * remote(tariffs, @5$5)::@15$2=@-1$2 - @-6$2::@15$3=@-1$3 - @-6$3::@15$4=$2 + $3::@15$6=floor(@-1$6 - @-6$6)::@17$2=@-2$2 * remote(tariffs, @5$2)::@17$3=@-2$3 * remote(tariffs, @5$3)::@17$4=@-2$4 * remote(tariffs, @5$4)::@17$5=$2 + $3 + $4::@17$6=@-2$6 * remote(tariffs, @5$5)::@20$2=@-1$2 - @-6$2::@20$3=@-1$3 - @-6$3::@20$4=$2 + $3::@20$6=floor(@-1$6 - @-6$6)::@22$2=@-2$2 * remote(tariffs, @5$2)::@22$3=@-2$3 * remote(tariffs, @5$3)::@22$4=@-2$4 * remote(tariffs, @5$4)::@22$5=$2 + $3 + $4::@22$6=@-2$6 * remote(tariffs, @5$5)::@25$2=@-1$2 - @-6$2::@25$3=@-1$3 - @-6$3::@25$4=$2 + $3::@25$6=floor(@-1$6 - @-6$6)::@27$2=@-2$2 * remote(tariffs, @5$2)::@27$3=@-2$3 * remote(tariffs, @5$3)::@27$4=@-2$4 * remote(tariffs, @5$4)::@27$5=$2 + $3 + $4::@27$6=@-2$6 * remote(tariffs, @5$5)::@30$2=@-1$2 - @-6$2::@30$3=@-1$3 - @-6$3::@30$4=$2 + $3::@30$6=floor(@-1$6 - @-6$6)::@32$2=@-2$2 * remote(tariffs, @5$2)::@32$3=@-2$3 * remote(tariffs, @5$3)::@32$4=@-2$4 * remote(tariffs, @5$4)::@32$5=$2 + $3 + $4::@32$6=@-2$6 * remote(tariffs, @5$5)::@35$2=@-1$2 - @-6$2::@35$3=@-1$3 - @-6$3::@35$4=$2 + $3::@35$6=floor(@-1$6 - @-6$6)::@37$2=@-2$2 * remote(tariffs, @6$2)::@37$3=@-2$3 * remote(tariffs, @6$3)::@37$4=@-2$4 * remote(tariffs, @6$4)::@37$5=$2 + $3 + $4::@37$6=@-2$6 * remote(tariffs, @6$5)::@40$2=@-1$2 - @-6$2::@40$3=@-1$3 - @-6$3::@40$4=$2 + $3::@40$6=floor(@-1$6 - @-6$6)::@42$2=@-2$2 * remote(tariffs, @6$2)::@42$3=@-2$3 * remote(tariffs, @6$3)::@42$4=@-2$4 * remote(tariffs, @6$4)::@42$5=$2 + $3 + $4::@42$6=@-2$6 * remote(tariffs, @6$5)::@45$2=@-1$2 - @-6$2::@45$3=@-1$3 - @-6$3::@45$4=$2 + $3::@45$6=floor(@-1$6 - @-6$6)::@47$2=@-2$2 * remote(tariffs, @6$2)::@47$3=@-2$3 * remote(tariffs, @6$3)::@47$4=@-2$4 * remote(tariffs, @6$4)::@47$5=$2 + $3 + $4::@47$6=@-2$6 * remote(tariffs, @6$5)::@50$2=@-1$2 - @-6$2::@50$3=@-1$3 - @-6$3::@50$4=$2 + $3::@50$6=floor(@-1$6 - @-6$6)::@52$2=@-2$2 * remote(tariffs, @6$2)::@52$3=@-2$3 * remote(tariffs, @6$3)::@52$4=@-2$4 * remote(tariffs, @6$4)::@52$5=$2 + $3 + $4::@52$6=@-2$6 * remote(tariffs, @6$5)::@55$2=@-1$2 - @-6$2::@55$3=@-1$3 - @-6$3::@55$4=$2 + $3::@55$6=floor(@-1$6 - @-6$6)::@57$2=@-2$2 * remote(tariffs, @6$2)::@57$3=@-2$3 * remote(tariffs, @6$3)::@57$4=@-2$4 * remote(tariffs, @6$4)::@57$5=$2 + $3 + $4::@57$6=@-2$6 * remote(tariffs, @6$5)::@60$2=@-1$2 - @-6$2::@60$3=@-1$3 - @-6$3::@60$4=$2 + $3::@60$6=floor(@-1$6 - @-6$6)::@62$2=@-2$2 * remote(tariffs, @6$2)::@62$3=@-2$3 * remote(tariffs, @6$3)::@62$4=@-2$4 * remote(tariffs, @6$4)::@62$5=$2 + $3 + $4::@62$6=@-2$6 * remote(tariffs, @6$5)


* 2018
#+TBLNAME: bills2018
|-----------+--------------+---------------+-----------+-----------+--------------------------|
| Месяц     | Горячая вода | Холодная вода | Водоотвод |     Итого |            Электричество |
|           |        м3/м3 |         м3/м3 |           |           |                    кВт/ч |
|-----------+--------------+---------------+-----------+-----------+--------------------------|
| Январь    |              |               |           |           |                          |
| показания |      353.145 |       328.576 |           |           |                  15762.5 |
| расход    |        9.441 |         8.416 |    17.857 |           |                    256.7 |
|           |              |               |           |           |                          |
| цена      |    1704.5726 |      297.9264 | 448.56784 | 2451.0668 |                 1037.068 |
|-----------+--------------+---------------+-----------+-----------+--------------------------|
| Февраль   |              |               |           |           |                          |
| показания |      360.805 |       336.533 |           |           |                  16002.5 |
| расход    |         7.66 |         7.957 |    15.617 |           |                     240. |
|           |              |               |           |           | недоплата 1.22 => 970.82 |
|           |     1383.013 |      281.6778 | 392.29904 | 2056.9898 |                    969.6 |
|-----------+--------------+---------------+-----------+-----------+--------------------------|
#+TBLFM: @5$2=@-1$2 - remote(bills2017, @59$2)::@5$3=@-1$3 - remote(bills2017, @59$3)::@5$4=$2 + $3::@5$6=@-1$6 - remote(bills2017, @59$6)::@7$2=@-2$2 * remote(tariffs, @6$2)::@7$3=@-2$3 * remote(tariffs, @6$3)::@7$4=@-2$4 * remote(tariffs, @6$4)::@7$5=$2 + $3 + $4::@7$6=@-2$6 * remote(tariffs, @6$5)::@10$2=@-1$2 - @-6$2::@10$3=@-1$3 - @-6$3::@10$4=$2 + $3::@10$6=@-1$6 - @-6$6::@12$2=@-2$2 * remote(tariffs, @6$2)::@12$3=@-2$3 * remote(tariffs, @6$3)::@12$4=@-2$4 * remote(tariffs, @6$4)::@12$5=$2 + $3 + $4::@12$6=@-2$6 * remote(tariffs, @6$5)
#+TBLFM: @5$2=@-1$2 - remote(bills2017, @59$2)::@5$3=@-1$3 - remote(bills2017, @59$3)::@5$4=$2 + $3::@5$6=@-1$6 - remote(bills2017, @59$6)::@7$2=@-2$2 * remote(tariffs, @6$2)::@7$3=@-2$3 * remote(tariffs, @6$3)::@7$4=@-2$4 * remote(tariffs, @6$4)::@7$5=$2 + $3 + $4::@7$6=@-2$6 * remote(tariffs, @6$5)::@10$2=@-1$2 - @-6$2::@10$3=@-1$3 - @-6$3::@10$4=$2 + $3::@10$6=@-1$6 - @-6$6::@12$2=@-2$2 * remote(tariffs, @6$2)::@12$3=@-2$3 * remote(tariffs, @6$3)::@12$4=@-2$4 * remote(tariffs, @6$4)::@12$5=$2 + $3 + $4::@12$6=@-2$6 * remote(tariffs, @6$5)::@15$2=@-1$2 - @-6$2::@15$3=@-1$3 - @-6$3::@15$4=$2 + $3::@15$6=floor(@-1$6 - @-6$6)::@17$2=@-2$2 * remote(tariffs, @6$2)::@17$3=@-2$3 * remote(tariffs, @6$3)::@17$4=@-2$4 * remote(tariffs, @6$4)::@17$5=$2 + $3 + $4::@17$6=@-2$6 * remote(tariffs, @6$5)
